{
    "dataset": {
        "pin blocked": [
            "\nHow do I unblock my PIN?",
            "What do I do to unblock my PIN?",
            "What if I type in the wrong PIN too many times?",
            "I cannot try my PIN anymore.",
            "My PIN can't access my card, can you help?.",
            "I must have entered my PIN wrong.",
            "What do I do if I forgot my PIN?",
            "I have used all my PIN tries, what now?",
            "Where do I unblock my PIN?",
            "I forgot my PIN number.",
            "I cannot use my PIN.",
            "I need my PIN unlocked.",
            "I tried my PIN too many times and now my card won't work!",
            "What is the procedure of unblocking my PIN?",
            "My PIN isn't working.",
            "How do I take a block off my card?",
            "I have exceeded all my PIN tries",
            "Can you unblock my account?  I entered the PIN wrong.",
            "My PIN number was incorrect, and I can't access it.",
            "How can I unblock my PIN?",
            "How do I unblock my card?"
        ],
        "receiving money": [
            "Which foreign currencies can I get transferred into my account?",
            "I have obtained the salary in GBP, will it need to be configured?",
            "Can I transfer my payroll to the bank?",
            "Can I transfer my salary if its in GBP?",
            "Will my GPB update my salary",
            "Can I get paid for this in another currency?",
            "What will I need to configure if my salary is in GBP?",
            "My salary is in GBP. Do I need to configure this somewhere?",
            "Can I transfer my salary onto here?",
            "If my salary is in GBP, do I need to do something?",
            "I use GBP for my salary deposits. Must I set this up somewhere?",
            "What do I need to do to receive my payroll in the account?",
            "I am paid by my employer in GBP; do I need to do anything in the app to indicate this?",
            "Can I directly deposit my salary to this account?",
            "am i able to receive my salary this way?",
            "My salary is received in the form of GBP. Is it necessary to configure this? If so, where is this done?",
            "How can my boss pay me directly to the card?",
            "My salary is deposited in GBP. Do I need to choose the currency?",
            "How can you transfer my salary to my correct currency?",
            "how do i find out about transfers",
            "How do I know what my account is set to, I am paid in GBP?",
            "Can I receive my salary with this in another currency?",
            "Do I need to add my salary?",
            "I received a transfer in GBP how do I change it to a different currency?",
            "Do you support direct deposits from my employer?",
            "Can my salary be received and transferred to my current currency in my country?"
        ],
        "visa or mastercard": [
            "What credit cards do you carry",
            "I would like to get a Visa card",
            "I hope to get a Visa card",
            "Do I have to pick a creditcard brand?",
            "What type of card can I get?",
            "Do you let me choose between Visa and Mastercard?",
            "Please give me both Visa and MasterCard, is it possible?",
            "Is it possible to get both Mastercard and Visa card from you?",
            "Can I get both a Visa and a Mastercard from you?",
            "I do not want a VISA card.",
            "Mastercard is preferred to me.",
            "No Visa please. I want to continue with Mastercard.",
            "Is it possible to obtain both a Visa and a Mastercard from you?",
            "I prefer Mastecard.",
            "I want to get a Visa",
            "I'd prefer Mastercard.",
            "Do you supply both Visa and Mastercard?",
            "What type of card will I receive?",
            "I need a Visa card",
            "This transaction needs both a Visa and a Mastercard.",
            "Can I get a Visa instead of a MasterCard?",
            "I'd like to get a Visa card, please.",
            "I prefer to get a Mastercard.",
            "I would prefer a Mastercard.",
            "Can I choose between Visa and Mastercard?",
            "Given a choice, I'd rather have Mastercard.",
            "What do I have to do to get a Visa card?",
            "Can I pick between Visa and Mastercard?",
            "I would like a Visa card.",
            "If I can't choose my card type will I be able to use it everywhere?",
            "Why can I not choose the card i want?",
            "Do I have an option between Visa and MasterCard?",
            "Can I choose my card scheme?",
            "I won't be pleased unless I get a Mastercard.",
            "I'm happy with Mastercard and want to stick with just that credit card."
        ],
        "declined cash withdrawal": [
            "Is my card actually working? It's the first time I tried using it",
            "I tried to get money out of the Notting Hill ATM earlier, but I wasn't able to get it to work. Is my card with issue? It's the first time I tried using it.",
            "Why can't I withdraw funds from my account?",
            "The ATM keeps declining my card! I tried two different ATMs already can you please check if everything is alright with my account??",
            "The ATM wouldn't allow me to withdraw money",
            "My ATM transaction was cancelled.",
            "I tried using my ATM card at your Notting Hill location today.  It did not work.  Am I doing something wrong?",
            "Help! My card isn't working at the ATM and I know I used the right PIN. Trying to get my money.",
            "This is the first time I've tried to get my money out of an ATM and it didn't work. Please give me my money",
            "The ATM keeps rejecting my Payment. I tried two different ATMs but did not work .Can you please check if everything is okay with my account?",
            "i tried to withdraw money but was told i didn't have funds",
            "I tried to get money out of the Notting Hill ATM earlier, but I wasn't able to get anything out. Is there a problem with my card? It's the first time I tried using it.",
            "I'm trying to take money from my account but its not letting me. Help!",
            "my card was frozen due to putting in the wrong pin too much.  how many tries do i have",
            "Why does the ATM continually decline my card? I've tried multiple times on different machines with the same results. I thought I had enough funds for this, so please help me understand why this is happening.",
            "How do I get money from an ATM using my card? I can't seem to get it to work? I used the pin I had, but maybe it's wrong? What do I need to do to fix this?",
            "I tried to get money out of the Notting Hill ATM earlier, but wasn't able to. Is my card working okay? It's the first time I tried using it.",
            "Tried using my ATM card earlier at one of your locations for the first time.  It didn't work.  What is going on?",
            "I tried to use the ATM today but it would not accept my card.",
            "I entered the correct pin but I still couldnt get funds.",
            "My card didn't work at the ATM in Notting Hill.  Is my card working?",
            "why wouldnt the atm give me money",
            "The ATM keeps declining my Transaction . I tried two different ATMs already Would you please check if everything is okay with my account?",
            "I can't get any money from my account.",
            "The ATM machines keep declining my card and I don't know why. I thought I had money in my account. Why is this happening?",
            "I could not get the ATM to work"
        ],
        "beneficiary not allowed": [
            "I have to transfer money over to my mother, and I have tried numerous times and all that keeps happening is error messages.",
            "Hi, I am interested buying crypto currency but unable to purchase it through the application. I do want to do the exchange, Could you please let me know what is the problem?",
            "why didnt a transfer to my account process",
            "Why does my transfer keep generating an error message?",
            "I tried transferring to an account but it won't let me.",
            "Why can't I transfer to an account?",
            "My money didnt go through after I transferred.",
            "Hi, I'm trying to by some crypto and the app isn't allowing it. I really want to exchange this, what am I doing wrong?",
            "Why won't you take my transfer, I keep getting an error message.",
            "My attempted transfer keeps kicking back with an error message.  Could you please help me to resolve this?",
            "Hello I am unable to exchange the crypto currency through the app, i am very keen to buy. Please let me know the issue.    interested buying crypto currency but i am unable to purchase it through the application,i do want to do the exchange, Could you please let me know what is the problem?",
            "Why can't I buy cryptocurrency on the app?",
            "I really was trying to complete this exhange. I was trying to purchase some crypto but the app won't allow me to do it. Can you tell me what's going on here?",
            "My card isn't letting me purchase something and I wanted to know why.",
            "Hi i received an error message informing me about the transaction failure. I have done the money transfer before and it never failed. Please let me know what is the issue this time.",
            "why wasn't a transfer to account approved",
            "I've been trying to make a transfer and it hasn't gone through. Now I am receiving an error message.  What is the problem?"
        ],
        "direct debit payment not recognised": [
            "Recently, a few weeks ago there was a transaction made on my account by some seller that I don't recognize. I am very certain that didn't happen  and will like for you to trace back to make sure.",
            "I have an unauthorized charge.",
            "If I found an error in my account for a transaction I didn't make, how long to I have to dispute it?",
            "Am I able to look back at a transaction to see who with drawled some money from my account? I don't remember authorizing this a few weeks ago, but wanted to double check who took the money.",
            "I checked my account and see that funds were deducted from a seller I didn't approve of. Can you help me understand?",
            "A few weeks ago, a strange transaction was made on my account by a seller I don't know. I am quite sure I didn't do it and will like for you to check it for me."
        ],
        "wrong amount of cash received": [
            "I wanted to withdraw $100 from the ATM but I only got $20",
            "I requested $100 but only got $20",
            "The machine only paid me a hundred when I wanted 20",
            "I visited the ATM but got less money than what I requested. Why?",
            "I got less than what i asked for in the ATM, why?",
            "The ATM only gave me 10 pounds when I withdrew 30. What do I do?",
            "Help, your app is showing a larger WD than I actually did earlier at an ATM.",
            "Got only $20 when I tried to withdraw $100.",
            "The ATM is messed up. It gave me less than I wanted.",
            "The ATM didn't give me enough money.",
            "I didn't get all the money I asked for",
            "Can you explain why the ATM is giving me less money than what I asked for?",
            "How can I get my money that I didn't get from the ATM?",
            "Why did I only get $20 when I asked for $100?"
        ],
        "country support": [
            "What countries can I use my account in?",
            "I have my residency in the US, but I would love to get a card.",
            "What countries do your accounts send and receive to?",
            "I live in the US and I would like to get a card. How do I go about getting one?",
            "Can I get a card that works in other countries like Africa and Indonesia?",
            "I need a new card and I live in the United States.",
            "I live in America, but I would like a card.",
            "i live in portugal. do you operate here?",
            "Can the card be mailed to Europe?",
            "Is it possible for a person who lives in the US to get a card?",
            "How many countries do you work in?",
            "Do you have to be in the UK to get a card?",
            "Although I am not located in the UK area, may i still receive a card?",
            "Is it possible to get a card when i'm not in the UK?",
            "If I don't live in the UK, can I get a card?",
            "Can I apply for one of your cards if I live in the EU?",
            "If I don't live in the UK, can I still get a card?",
            "Are cards issued to people living in the US?",
            "I am not in the UK can i get a card?",
            "Any chance of getting the card outside the UK?",
            "What countries are you issuing cards for?",
            "Are these cards available in europe?",
            "Is it possible to get one of your cards in the European Union?",
            "I live in the EU.  Can I order one of your cards?",
            "Are your cards available in the EU?",
            "Is this card available to United States Residents?",
            "Can an American resident apply to get a card?",
            "Where in the European Union can I get a card?",
            "How does a US resident go about acquiring a new card?",
            "Can I get a card in the EU?",
            "Do you work in Greece?",
            "You operate in which countries?",
            "I live in Germany. Is that one of the countries you are in? What other countries are you in?",
            "Please tell me how to get a card if I reside in the US.",
            "I live in the UK. Can I get a card?",
            "How do I get a card if I live in the US?",
            "Is it possible to get one the your cards in the EU?",
            "Which countries do you operate in",
            "what countries can i use my card in"
        ],
        "passcode forgotten": [
            "I am unaware of what my password is.",
            "I don't remember my login code",
            "I'm locked out of my account as I can't remember my code, what do I do now?",
            "I used to know my password, but not anymore.",
            "Help me!  I don't know what my password is.",
            "I can't remember my password.",
            "I can't find my code",
            "I've completely forgot the code to get into the app.",
            "I can't access my account.",
            "I forgot my code",
            "I lost the code and can not get into the app. Help!",
            "I don't know my password",
            "Can you lookup my password?"
        ],
        "age limit": [
            "How old can one use your service?",
            "How can I open an account for my children?",
            "How old must I be to open an account?",
            "If I want my son to have his own account is that possible?",
            "How old do you need to be to have an account?",
            "What are the requirements to open an account for a minor?",
            "Can I get an account for my daughter?",
            "Can my children have an account?",
            "Could my daughter open an account?",
            "My daughter needs to open account.",
            "How old do you have to be to open an account?",
            "Can my daughter make an account?",
            "Am I able to open an account for my children?",
            "Do you offer account services for children and teens?",
            "Is it possible for me to set up separate accounts for my kids?",
            "How old do my kids need to be to open an account?",
            "My son has just turned 13, is he old enough for an account?",
            "I am 16 and just started working at McDonalds can I deposit my checks at your bank?",
            "Can I make an account for my kids?",
            "Would it be possible to open up an account for children?",
            "Do you offer account's for minors?",
            "Would I be able to get an account for my child?",
            "May I get an account for my daughter?",
            "Can my children open an account?",
            "What's the youngest I can be to open an account?",
            "We want to start a college fund for my daughter.",
            "Can I start an account for my kids?",
            "Can I open up an account for my child?",
            "What does my daughter need to open an account?"
        ],
        "why verify identity": [
            "My Identity verification hasn't passed yet is it possible to use my account?",
            "I'm waiting for the ID verification to go through still, so is it too soon to use my account?",
            "Do you need to know my first and last name?",
            "I am still waiting for verification.  Can I use my account before I am verified?",
            "I don't want to give you all my identify details.",
            "Why do you need to know so much about me for my account?",
            "What is with the need to have all my ID information?",
            "Why do you require identification documents"
        ],
        "exchange via app": [
            "I am from X but am traveling to Y - how do I get currency for Y?",
            "I would like to change currency",
            "Is it possible to change from USD to GBP with your App?",
            "Can this convert money?",
            "I can't figure out how to change GBP to AUD, what do I do?",
            "How can I convert currencies?",
            "How do I change my currency to another?",
            "How do I change to AUD from GBP?",
            "How do I change to a different currency?",
            "How to I switch my money for the money used in another country?",
            "I'm having difficulties changing AUD for GBP. How do I do this?",
            "How do I switch to a different currency?"
        ],
        "exchange charge": [
            "what is the cost for exchanging currencies?",
            "If someone in a different country sends me money, do I have to pay a fee?",
            "Are there any extras for exchanging currency?",
            "I have foreign currency i would like to change how much will it cost me?",
            "What is the fee for accepting money from a foreign country?",
            "would I need to pay extra for exchanging currencies?",
            "Is there a few for exchanging foreign currencies?",
            "What kind of costs are involved for exchanging currency?",
            "is there a frequent currency discount?",
            "What commission do you take for currency exchage?"
        ],
        "atm support": [
            "What locations allow me to withdraw money?",
            "I need help from someone in your department with finding my nearest ATM.",
            "What ATM accepts Mastercard?",
            "Can I get money out of any machine?",
            "What ATM machines allow this card?",
            "Do all ATMs accept this card?",
            "What kind of ATMs would this card be accepted at?",
            "Can I use my card to withdraw from my account?",
            "ATMs, which ones will accept this card?",
            "Tell me what ATMs use this card.",
            "Can this card be used at all ATMs?",
            "How can I find an ATM that accepts this card?",
            "Am I limited to what ATM I can use my card?",
            "\nAt which ATMs can I use this card?",
            "What ATMs use this card?",
            "How do I withdraw money?",
            "Where can money withdrawals be made?",
            "Tell me what ATMs take this card.",
            "Can I use my card at an ATM?",
            "I need to withdraw money. Where can I do that?",
            "Where can I find Mastercard ATMs?",
            "What ATMs can I use this card at?",
            "Are there specific ATM's I can use with this card?",
            "Is there a list of ATMs that take this card?",
            "Which ATMs am I allowed to get money from?",
            "Where is the nearest Mastercard ATM?",
            "How can I tell if an AMT will take this card?",
            "Where can I withdraw money from?",
            "Where should I withdraw money from?"
        ],
        "cancel transfer": [
            "I accidentally made a payment to a wrong account. What should I do?",
            "I made a terrible mistake when typing in my account number.  I accidently sent money to the wrong account.  I noticed the app won't allow me to void the transaction.  Can someone help me with this immediately?",
            "I paid my rent into the wrong account, could you please pay it into the right account, it needs to be done by tomorrow.",
            "I accidentally made a payment from the wrong account yesterday. It's my rent payment, and it's very large, so the account I paid from won't be able to cover the amount. It's really important that the payment be made from the right account?",
            "Cancelling a transaction",
            "Is there a way to revert a transaction?",
            "I used the wrong account.",
            "Please help me, there is a transaction in the incorrect account.",
            "I need to reverse a transaction",
            "I made a transaction to the wrong account!",
            "Could you refund my transaction, I paid it into the wrong account. I need to be able to pay it into the right account by tomorrow.",
            "How do I fix a transaction to the wrong account?",
            "I just realized I made the wrong transaction yesterday. Would  you please make it correct?I need it by tomorrow Please.",
            "There was a transaction this morning that I'd like to reverse.",
            "I want to reverse a transaction I did this morning",
            "My transaction from earlier needs to be reversed.",
            "I am trying to revert a transcation I did this morning",
            "I inadvertently completed a transaction on a wrong account.",
            "I made a mistake and performed a transaction on the wrong account!",
            "I made a transaction this morning but I need to revert it now.",
            "I just realized I made the wrong transaction  yesterday. Would  you please make it correct?I need it by tomorrow.",
            "I stupidly initiated a rent payment from the wrong account yesterday. It can't be paid from that account, but it really needs to get paid on time. Am I able to move the payment to the right account?",
            "Hi , I just came to know I made the wrong transaction  yesterday. Would  you please make it correct?I need it by tomorrow."
        ],
        "edit personal details": [
            "I need to update my demographics.",
            "I need to change my phone number.",
            "I moved and would like to change my address.",
            "I need to change my home address.",
            "I need to change my address",
            "I need to change my data.",
            "How can I change my name because I just got married?",
            "My address needs to be changed.",
            "I need to change my contact information.",
            "I need to add my new address now that I've moved.",
            "I just moved. How do I give you my new address?",
            "I would like to change my adress",
            "How do I change my name?",
            "I need to change my last name on my account because I just got married.",
            "Can I change my name?  I am not married.",
            "Since I just got married I need to change my name.",
            "I moved so I need to change my address. How do I do that?",
            "where can I change my address?",
            "Is it possible to change my address?",
            "How can I change my address?"
        ],
        "cash withdrawal charge": [
            "How much money can I withdraw before fees? I noticed a fee on my card but I didn't think I had hit the limit of how much I could withdraw in a month.",
            "Could you explain your rules for ATM fees?",
            "Why did they take more money out then I withdrawed?",
            "How come I got to pay to get my money from the ATM?",
            "I saw a fee on my receipt from withdrawing money while shopping earlier.  Is there supposed to be a fee for this type of transaction?",
            "Why did withdrawing money cost me extra?",
            "I just had a look at my statement. Why have I been changed for using the ATM?",
            "What's up with the extra fee I got?",
            "Explain the extra ATM fees.",
            "I didn't realize that there were any fees for withdrawing money from my account--this has never happened to me before.  What exactly are the fees?"
        ],
        "apple pay or google pay": [
            "Can I use my Apple watch to fill my gas tank?",
            "I want to top up my account. Can I do it with Google Pay?",
            "What services can I use to top up?",
            "Is top-up possible with Apple Pay?",
            "Can I add funds directly from my Apple Watch?",
            "I would like to know if I can top up with Google Pay.",
            "Will be Apple Watch be able to let me top up?",
            "How can I top up with Apple Pay?",
            "I seem to be having trouble with my Google Pay Top. Can you please help?",
            "Unable to use my American Express with Apple Pay to top up my account",
            "What should I do to top up using my Apple Watch?",
            "I would like to use top-up with my Apple Pay.",
            "How can I set up Google Pay on my device?",
            "Google Pay won't let me top up.",
            "Can I use Apple Pay to top-up?",
            "I can't use top up on Google Pay.",
            "What are the steps needed to top up with Apple Pay?",
            "Is topping up with Apple Pay possible?"
        ],
        "request refund": [
            "Canceling my order is what I need to do right now.",
            "I bought something online a week ago and i never got it in the mail.Can I just get my money back now I don't want to keep waiting on something that isn't going to show up.",
            "I would like to cancel my order.",
            "Give me back my money, I'm not paying the sellers. It has been a long time ago that I made an order and it just isn't coming.",
            "I no longer want this can i cancel my purchase?",
            "Can you please help me in canceling my order.",
            "Can i cancel this purchase?",
            "How do I cancel a purchase?",
            "I would like to return my purchases",
            "I would like to cancel my previous purchase.",
            "I am interested in cancelling a purchase",
            "I would like to cancel my purchase.",
            "I just bought an item and would like to stop payment, is this possible?  The item has not been received yet.",
            "I'm going to cancel a purchase.",
            "I want to cancel my purchase",
            "My order hasn't shown up yet, what can I do?",
            "I want to cancel a purchase",
            "It's been some time ago that I placed an order and it just isn't coming. At this point just give me back my money because I'm not paying them.",
            "How do I get my money back for something I bought?"
        ],
        "transaction charged twice": [
            "There are two of the same charge on my statement.",
            "There is a duplicate payment on my card. Why?",
            "I have a duplicate charge",
            "My bill shows the same charge more than once",
            "Looks like my card payment was duplicated after all. I went to pay at the store earlier, got declined once,second time it works. App still stays pending for one of the payments. Can you remove one of them as it's wrong and clearly was declined?",
            "A duplicated payment was made for something.",
            "My account seems a bit off and getting weird charges.",
            "there were two of the same charge to my account",
            "There are two of the same charges on my account.",
            "Transaction showing up many times.",
            "How can I fix this?  There is a double charge on my account.",
            "I have two of the same charges on my account!",
            "I received duplicate charges.",
            "My card was declined but it shows as multiple charges?",
            "I have a duplicate payment on my card.",
            "I see a duplicate payment.",
            "Who should I talk to or go to resolve a duplicate charge on my statement?"
        ],
        "card delivery estimate": [
            "Can I have it delivered on a specific date?",
            "How long are deliveries to the US?",
            "To deliver to the US, how long will it take?",
            "How long will this take to get to me?",
            "Can it specifically be delivered on a certain date?",
            "Is there a specific date it can be delivered by?",
            "How many days to deliver to a US customer?"
        ],
        "reverted card payment?": [
            "I tried to buy something online but my funds were transferred back to my account. What is happening?",
            "I sent a payment but now it's not showing up.",
            "Why wasn't my payment accepted by the app",
            "I purchased something and already received it, why hasn't the money taken out?",
            "I made a payment but it was returned.",
            "The money is still in my account even though I already paid -- I don't understand what happened.",
            "Hello, I was contacted by a seller who let me know my money didn't come through on their side. It most certainly came out of my account so I need this looked at immediately because now it has been returned to me!",
            "I made a payment but the app cancelled it.",
            "My money is back in my account after a seller contacted me stating they never received payment. I am positive it was deducted out of my account. Please get this sorted out right away.",
            "I have an issue. I bought something within the past one to two weeks and have received one of the products; however, today the total was returned to my account. What's going on here?",
            "My payment has been returned.",
            "Why would my payment have been returned to my account?",
            "Why did the funds for one of my purchase come back to my account?",
            "My payment was put back, I think.",
            "I was refunded the money for something I bought already.",
            "How come the money from the merchant appeared back into my account?",
            "I've got a weird problem: I purchased something a week or maybe it was two weeks ago, and the funds have come back into my account! Can you explain this?",
            "Is it on purpose that my payment has been returned to my account?",
            "why did my payment revert",
            "I made a payment but the app gave the money back.",
            "I'm not sure what is going on here. I've received payment back into my account  for an item I've already received, from about 2 weeks ago.",
            "Why have I received a rebate for my payment after a week?",
            "A seller is stating that they haven't received money yet when the money has already deducted from my account.",
            "My payment was stopped",
            "I wanted to purchase something online but the payment was returned back to me. This has been going on for a couple of weeks. Please tell me what is going on here?"
        ],
        "supported cards and currencies": [
            "I have an American Express that I'd like to add money to my account with.",
            "What type of card can I use to top up?",
            "I want to top up by card, what do you support?",
            "I have a second credit card from the US. Will you take it?",
            "What payment methods are used to top up?",
            "Top up my card please, which y'all support?",
            "Am I able to add money into my account using my American Express?",
            "If I want to topup by card, how do I do it?",
            "I want to top up by using a credit card, which ones do you support?",
            "What card or currency can I use to pay?",
            "What are my payment options?",
            "why don't you accept american express for adding money to my account",
            "I want to deposit funds, what payments are accepted?",
            "I just have one additional card from the USA. Do you support that?",
            "How can I top up my card with another card?",
            "I have another card from the U.S. Will you be able to accept that one?",
            "how can i transfer money from american express card",
            "What currency can I use to add money?",
            "How can I fund another account with my American Express?",
            "I need to know if you will accept my credit card.",
            "Will you accept my credit card, it my only one.",
            "Am I able to use my American Express to add money to my account balance?",
            "Help me use American Express to add money to the account.",
            "can i top up from a usa credit card",
            "What currency is acceptable for a top up?",
            "do you accept from usa credit card?",
            "I only have a card from the US is that okay?",
            "Do you accept Mastercard?"
        ],
        "get physical card": [
            "How do I know what my PIN is?",
            "How do I request the PIN?",
            "I've been waiting ages and my PIN hasn't gotten here.",
            "wheres my pin",
            "Why have I not received my PIN",
            "How long do I wait for my PIN",
            "Where should I look for my PIN number at?",
            "I dont have a pin",
            "I have not received my pin yet",
            "Is my PIN recorded anywhere?",
            "I'm not sure what to do about the PIN, because I don't have one yet.",
            "I am yet to receive my pin.",
            "What's my pin number?",
            "Is the PIN separately delivered?",
            "Where can the pin be located?",
            "Where is my PIN?",
            "I can't find my PIN anywhere.",
            "Where can I find my PIN? I haven't gotten it yet.",
            "can i create my own pin right away",
            "Is my PIN the same thing as my passcode?"
        ],
        "verify source of funds": [
            "Where can I find information about where my money came from?",
            "Can I see my available money?",
            "How do I know where my money comes from?",
            "How can I tell where the money came from?",
            "Is there a way to see where my money originally came from?",
            "help me find where this money came from",
            "Where can I check to see where the money in my account came from?",
            "Where can I find my fund information?",
            "Can I see where my money came from?",
            "where is this money from",
            "Is there a way for me to check my balance?",
            "Is there a way to tell where the money came from?",
            "Where did my money come from?"
        ],
        "transfer not received by recipient": [
            "I'm waiting for my transaction to complete.",
            "I sent money to someone but they haven't gotten it, what's going on?",
            "What happens when I money transaction doesn't show up on the receiving side?",
            "How come my money hasn't shown up yet?",
            "Why hasn't my transaction arrived to my friend yet?",
            "Why hasn't my transaction arrived?",
            "How long do I have  to wait for my transaction to be completed?",
            "I sent a payment but it isn't showing up in the app",
            "What is the length of a transaction completion?",
            "I've been waiting since Friday, where is my money?",
            "why hasn't a transaction to a friend cleared yet?",
            "Why didn't my friend's transaction arrive yet?",
            "Why can't the recepient of my money transaction see it?",
            "I am just waiting on the completion of the transaction.",
            "Where is my last money transaction",
            "why has a transaction to a friend been delayed?",
            "Why hasn't the transaction I did to my friend arrived yet?",
            "A transaction to a friend still hasn't shown up.",
            "I'm still awaiting for the completion of the transaction.",
            "I payed my rent to my landlord a few days ago and he is saying the it never went though. Everything looks good to me and I even double checked the account number. I don't know what could be causing the confusion. Can you help me please?",
            "I'm getting concerned here.  I sent a friend some money and she isn't seeing it.  What's going on?",
            "Why hasn't a transaction I did to my friend arrived yet?",
            "Why is the transaction to my friend still pending?",
            "How long will a transaction to a friend take?",
            "i accidentally entered in my retailers information, what should i do next",
            "I have moved to a new house and set up a rent payment to my landlord, it was supposed to be in her account a few days ago but it hasn't arrived.  I definitely sent it to the right place, can you confirm where the money is?",
            "How long will my transaction take?",
            "I dont see my reciept",
            "When will I get my money? It's been too long.",
            "Why hasn't my transaction completed?",
            "Hi, I sent my landlord my rent money a few days ago and while everything seems good on my end he says that he never got the money. I double checked the account number and it's correct. Can you help me figure this out?",
            "My money transaction hasn't arrived."
        ],
        "fiat currency support": [
            "What currencies can I hold?",
            "Can you do exchanges of EUR?",
            "Can you make exchanges with the EUR?",
            "Which flat currencies can I use from you?",
            "How many different currencies can I hold money in?",
            "What types of foreign money can be used with this service.?",
            "I want to have multiple currencies in my account if possible.",
            "Are all European currencies available for holding and exchange?",
            "Can I exchange my money for EUR?",
            "Is it possible to hold money in different currencies?",
            "How many currencies can I have money in in my account?",
            "Is it possible to hold money in multiple currencies?",
            "How many currencies can I have?",
            "Do you hold money and if so, what currencies do you accept?",
            "Do you allow exchanges of EUR?",
            "What flat currencies do you use for holding and exchanges.",
            "Does my account have the option to hold multiple currencies?",
            "Which currencies will you exchange?",
            "What currencies can I not hold many in, if so what are they?",
            "What currencies can I have?",
            "Will you be able to exchange to EUR?",
            "can I have multiple currencies?"
        ],
        "lost or stolen phone": [
            "I was mugged.  They took everything.  I can't use the app.  What do I do?",
            "I was recently mugged and would like to know if I have to have access to the app to use your services and how I would go about setting up your services on a new device belonging to a current user?",
            "I got mugged yesterday and they took everything. I can't use the app, so I need some help.",
            "What do I do if I can't access the app?",
            "What do I do if I cannot access the app?",
            "I cannot get to my app, what should I do?"
        ],
        "transfer timing": [
            "Transfers from the US how long will the wait be?",
            "How long does it take to get my money",
            "How long will it take the money to appear in my account?",
            "When will my account receive the money?",
            "When can I use money sent to my account?",
            "What is the wait time until money reaches my account?",
            "When will the money be made available in my account?",
            "When will my money be in my account?",
            "How long will it take for the money to reach my account?"
        ],
        "pending cash withdrawal": [
            "I made a deposit in the ATM and it has not cleared",
            "Looking at my account I've noticed a charge that appears to still be in progress. I had attempted to get money out of the machine earlier but the machine seemed to have been broken. I never received my money so will you please look into this for me? I don't want to be charged for money I never actually received.",
            "Why has my deposit in the ATM not cleared yet?",
            "I tried to access money earlier but the machine seems not to be working. After looking, the transaction actually shows to still being process. Can you find out what is going on here? I don't want to be charged for some money I never got.",
            "I tried to get some with-drawls but the machine didn't work. The transaction still seems in progress.Seems like  something is wrong,I don't want to be charged for Transaction i did not make.",
            "I tempted to get some money out of the machine earlier and it did not work.Looking now, the transaction actually shows to still be in progress. I would certainly appreciate someone look into this and let me know what's going on. I definitely do not want to be charged for money I never received."
        ],
        "unable to verify identity": [
            "The app does not know it is me.",
            "I am having trouble with the app recognizing me.",
            "The app does not believe that I am myself",
            "app malfunctioning, does not know its me",
            "The app doesn't think that I am myself",
            "The app doesn't believe that I am myself",
            "I'm having problems with ID verification"
        ],
        "compromised card": [
            "Questionable transactions on my account.",
            "There are transactions that I did not make on my account, I think someone has my information.",
            "How do I stop fraud to my account?",
            "What do I do if I detect fraudulent use on my car?",
            "I see some transactions that I don't recognize.  I think someone stole my details.",
            "I don't recognize some transactions.  Is someone else using it?"
        ],
        "cash withdrawal not recognised": [
            "There is money missing from my account.",
            "I think someone stole money from my card",
            "Someone stole my wallet a couple of hours ago now and they have taken money from my account. Is there any way that you can help so I won't lose any more of my money.",
            "There was money taken out of my account, and I'm pretty sure I didn't do it.",
            "I just lost my wallet and I think someone is using my card to withdraw my money. Can you please cancel or freeze my card?!!",
            "I want my card frozen right away. Money was taken out in an odd location I have never heard of.",
            "My wallet was taken and I see that someone is using my card!   Please help me!",
            "My wallet was just stolen, and they've already used my card! Please help, I can't afford to lose more money!",
            "Help!  The app has an ATM withdrawl that I didn't make.",
            "Help! I just realised someone has apparently withdrawn money using my card! It's from some odd remote town where I definitely haven't been. Please freeze it immediately!",
            "There are incorrect charges on my account, there was a WD that was made by someone else.  I still have my card though.",
            "The app is saying I made a withdrawl but I didn't.",
            "Money was taken out without my consent,",
            "Someone withdrew money from my account, and it wasn't me."
        ],
        "failed transfer": [
            "Hi I'm sending some money over to an investment bank I do business and the transaction is being rejected. I'm not sure why as I think I have the right details.",
            "Why was my transaction not approved?",
            "I have made 5 attempts to make a very standard survey, yet I can't get it to work. What is the problem? Is there an issue related to your system?",
            "Hi, I am currently in the process of buying a flat and I am waiting for the mortgage to go through but it keeps showing up as an error.  Do you know what could be causing this and can you help me get the money over.",
            "Why was my transaction declined?",
            "Hi, I'm buying my son Bertie a starter home in London.  I'm just trying to send the 5% deposit over to the agent. It's only £200,000 but seems to be throwing an error.  What is going on?  If I wait any longer the house prices might rise, can you look in to it please?",
            "I'm getting an error when trying to make a payment. I want to purchase a flat but my mortgage payment needs to go through. Can you help me?"
        ],
        "card payment not recognised": [
            "I don't think I made this transaction on my statement",
            "I don't understand where this charge came from.",
            "I've never been to that store.  That's a fraudulent charge.",
            "Why is there an uknown charge showing on my account?",
            "i disagree with a charge"
        ]
    },
    "from_scratch": false,
    "training_parameters": {
        "num_train_epochs": 50
    }
}